'''Дана строка текста, состоящая из букв русского алфавита "О" и "Р". Буква "О" – соответствует выпадению Орла, а буква "Р" – соответствует выпадению Решки. 
Напишите программу, которая подсчитывает наибольшее количество подряд выпавших Решек.

Формат входных данных:
На вход программе подается строка текста, состоящая из букв русского алфавита "О" и "Р".

Формат выходных данных:
Программа должна вывести наибольшее количество подряд выпавших Решек.
'''
stroka = input().split('О')
res = max(stroka, key=len)
print(len(res))
